Revit 2027 API
AnalysisDisplayVectorSettings.ArrowLineWeight Property
 Line weight assigned to arrow lines for vectors.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ArrowLineWeight { get; set; }
Public Property ArrowLineWeight As Integer
	Get
	Set
public:
property int ArrowLineWeight {
	int get ();
	void set (int value);
}
member ArrowLineWeight : int with get, set
Property Value
Int32
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace